> Nope I upgrades from beta1 to rc1 and the resource is the same `nomad_csi_volume`

Ah OK, I think I see what happened. Due to https://github.com/hashicorp/terraform-provider-nomad/issues/362, you likely got an error when trying to create the volume. Since the `apply` resulted in an error Terraform marked the resource as `tainted` and so it would try to recreate it on every apply:

```
$ terraform plan
nomad_csi_volume.a: Refreshing state... [id=test-123]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # nomad_csi_volume.a is tainted, so must be replaced
-/+ resource "nomad_csi_volume" "a" {
      ~ controller_required     = true -> (known after apply)
      ~ controllers_expected    = 1 -> (known after apply)
      ~ controllers_healthy     = 1 -> (known after apply)
      ~ id                      = "test-123" -> (known after apply)
        name                    = "test-123"
      ~ nodes_expected          = 1 -> (known after apply)
      ~ nodes_healthy           = 1 -> (known after apply)
      ~ plugin_provider         = "csi-hostpath" -> (known after apply)
      ~ plugin_provider_version = "v1.11.0" -> (known after apply)
      ~ schedulable             = true -> (known after apply)
      ~ topologies              = [
          - {
              - segments = {
                  - "topology.hostpath.csi/node" = "node-0"
                }
            },
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

The key line is this:
>  nomad_csi_volume.a is tainted, so must be replaced

One way to get around this problem is to run the [`terraform untaint`](https://developer.hashicorp.com/terraform/cli/commands/untaint) command on the resource after upgrading to RC1:

```console
$ terraform untaint nomad_csi_volume.a
Resource instance nomad_csi_volume.a has been successfully untainted.

$ terraform plan
nomad_csi_volume.a: Refreshing state... [id=test-123]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```



> I ran and all my old volumes were destroyed to recreate, data all gone....

I'm sorry that happened to you. Could you provide more details on which steps you took? Did you upgrade the plugin? What was the previous and the new version? Do you have the plan output? 